#include <iostream> 
#include <iomanip> 
#include <string> 
#include <Windows.h> 

using namespace std;

enum Спеціальність { Комп_Науки, ІТ, Математика_Економіка, Фізика_ІТ, Трудове_Навчання };
string СпеціальностіСтр[] = { "Комп’ютерні науки      ", "Інформатика            ", "Математика ", "Кібер безпека " };

struct Студент {
    string Прізвище;
    int Курс;
    Спеціальність спеціальність;
    int ОцінкаФізика;
    int ОцінкаМатематика;
    int ОцінкаІнформатика;
};

void Створити(Студент* p, const int N);
void Друк(Студент* p, const int N);
double РозрахуватиПроцентВідмінно(Студент* p, const int N);
void ВивестиСтудентівЗФізикою5(Студент* p, const int N);

int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    int N;
    cout << "Введіть кількість Студентів N: "; cin >> N;

    Студент* p = new Студент[N];

    Створити(p, N);

    double відсотокВідмінно = РозрахуватиПроцентВідмінно(p, N);
    cout << "Відсоток студентів, які вчаться на 'відмінно': " << відсотокВідмінно << "%" << endl;

    ВивестиСтудентівЗФізикою5(p, N);

    Друк(p, N);

    delete[] p; 
    return 0;
}

void Створити(Студент* p, const int N) 
{
    for (int i = 0; i < N; i++) {
        cout << "Номер№ " << i + 1 << ":" << endl;
        cout << " Прізвище: "; cin >> p[i].Прізвище;
        cout << " Курс: "; cin >> p[i].Курс;
        cout << " Спеціальність: 0 - Комп’ютерні науки, 1 - Інформатика, 2 - Математика , 3 - Кібер безпека :";
        int спеціальність;
        cin >> спеціальність;
        p[i].спеціальність = static_cast<Спеціальність>(спеціальність);
        cout << " Оцінка з фізики: "; cin >> p[i].ОцінкаФізика;
        cout << " Оцінка з математики: "; cin >> p[i].ОцінкаМатематика;
        cout << " Оцінка з інформатики: "; cin >> p[i].ОцінкаІнформатика;
        cout << endl;
    }
}

void Друк(Студент* p, const int N) {
    cout << "========================================================================================================================"
        << endl;
    cout << "| № | Прізвище | Курс | Спеціальність            | Фізика | Математика | Інформатика |"
        << endl;
    cout << "------------------------------------------------------------------------------------------------------------------------"
        << endl;
    for (int i = 0; i < N; i++) {
        cout << "| " << setw(0) << right << i + 1 << " ";
        cout << "| " << setw(9) << left << p[i].Прізвище
            << "| " << setw(5) << right << p[i].Курс << " "
            << "| " << setw(24) << left << СпеціальностіСтр[p[i].спеціальність]
            << "| " << setw(7) << right << p[i].ОцінкаФізика
            << "| " << setw(11) << right << p[i].ОцінкаМатематика
            << "| " << setw(11) << right << p[i].ОцінкаІнформатика << " |" << endl;
    }
    cout << "========================================================================================================================"
        << endl;
    cout << endl;
}

double РозрахуватиПроцентВідмінно(Студент* p, const int N) {
    int кількістьВідмінно = 0;

    for (int i = 0; i < N; i++) {
        if (p[i].ОцінкаФізика == 5 && p[i].ОцінкаМатематика == 5 && p[i].ОцінкаІнформатика == 5)
        {
            кількістьВідмінно++;
        }
    }

    return (static_cast<double>(кількістьВідмінно) / N) * 100.0;
}

void ВивестиСтудентівЗФізикою5(Студент* p, const int N) {
    cout << "Студенти, які отримали з фізики оцінку '5':" << endl;
    for (int i = 0; i < N; i++) {
        if (p[i].ОцінкаФізика == 5) {
            cout << p[i].Прізвище << endl;
        }
    }
}
